YanKE01/ESP-IDF-Lab/examples/dl/ppocr/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s31"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
# Detection can occupy a CPU longer than the default 5-second watchdog timeout.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=60
CONFIG_SPIRAM=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_PP_OCR_V6_MODEL_IN_FLASH_RODATA=y
CONFIG_FLASH_PP_OCR_V6_REC_S8=y
CONFIG_PP_OCR_V6_REC_S8=y
CONFIG_PP_OCR_V6_REC_MODE_SHORT=y
